content/about/_index.md
+++
title = "About"
author = ["Zakariya Oulhadj"]
draft = false
+++

Hi, I'm ****Zakariya Oulhadj**** 👋🏼

An aspiring software engineer passionate about low-level programming and
high-performance design. I specialise in **C** and **C++** with experience in Python as
well. My main interests include **computer graphics, rendering engine
architecture, and systems programming**, where I focus on building efficient
software from first principles.

Recently graduated with a distinction in **High-Performance Computing (M.Sc.)** from
the [University of Edinburgh](https://www.ed.ac.uk) and currently based in London, UK. For further
details you can view my [CV](/Zakariya_Oulhadj_CV.pdf).

Full time Linux user running Debian 13 (Trixie) with my main editor of choice
for programming being [Emacs](https://www.gnu.org/software/emacs/). My dotfiles are available on GitHub [here](https://github.com/ZOulhadj/dotfiles).

I am currently developing my own real-time cross-platform rendering engine in C
aiming to support multiple rendering APIs through a custom render command
system.


## Skills {#skills}

-   **Operating Systems**: Linux, Windows, macOS
-   **Programming Languages**: C11, C++23, Zig, Python
-   **APIs**: Win32, OpenGL 4.6, Vulkan 1.3, MPI, OpenMP
-   **Tools**: GDB, RenderDoc, Intel VTune, CrayPat, Scalasca, Linaro Forge
-   **Interests**: Rendering Engine Architecture, Performance Benchmarking and
    Optimisation, Network Attached Storages (Synology)

Check out my [Instagram](https://instagram.com/zoulhadj) for non-technical related content.
